{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "BuildPatchInstaller",
			"Children": [
				{
					"Source":
					{
						"Text": "Please Wait"
					},
					"Translation":
					{
						"Text": "Please Wait"
					},
					"Key": "BuildPatchInstaller_GenericProgress"
				},
				{
					"Source":
					{
						"Text": "{Current} / {Total} ({Speed}/sec)"
					},
					"Translation":
					{
						"Text": "{Current} / {Total} ({Speed}/sec)"
					},
					"Key": "BuildPatchInstaller_DownloadSpeedFormat"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstallError",
			"Children": [
				{
					"Source":
					{
						"Text": "A file access error has occurred. Please check your running processes."
					},
					"Translation":
					{
						"Text": "A file access error has occurred. Please check your running processes."
					},
					"Key": "BuildPatchInstallShortError_MoveFileToInstall"
				},
				{
					"Source":
					{
						"Text": "A file corruption has occurred. Please try again."
					},
					"Translation":
					{
						"Text": "A file corruption has occurred. Please try again."
					},
					"Key": "BuildPatchInstallShortError_FileConstructionFail"
				},
				{
					"Source":
					{
						"Text": "An unknown error ocurred. Please contact support."
					},
					"Translation":
					{
						"Text": "An unknown error ocurred. Please contact support."
					},
					"Key": "BuildPatchInstallShortError_InvalidOrMax"
				},
				{
					"Source":
					{
						"Text": "Could not download patch data. Please check your internet connection, and try again."
					},
					"Translation":
					{
						"Text": "Could not download patch data. Please check your internet connection, and try again."
					},
					"Key": "BuildPatchInstallShortError_DownloadError"
				},
				{
					"Source":
					{
						"Text": "Maximum path length exceeded. Please specify a shorter install location."
					},
					"Translation":
					{
						"Text": "Maximum path length exceeded. Please specify a shorter install location."
					},
					"Key": "BuildPatchInstallShortError_PathLengthExceeded"
				},
				{
					"Source":
					{
						"Text": "Not enough disk space available. Please free up some disk space and try again."
					},
					"Translation":
					{
						"Text": "Not enough disk space available. Please free up some disk space and try again."
					},
					"Key": "BuildPatchInstallShortError_OutOfDiskSpace"
				},
				{
					"Source":
					{
						"Text": "Patching service could not start. Please contact support."
					},
					"Translation":
					{
						"Text": "Patching service could not start. Please contact support."
					},
					"Key": "BuildPatchInstallShortError_ApplicationError"
				},
				{
					"Source":
					{
						"Text": "The application is closing."
					},
					"Translation":
					{
						"Text": "The application is closing."
					},
					"Key": "BuildPatchInstallShortError_ApplicationClosing"
				},
				{
					"Source":
					{
						"Text": "The following directory could not be created.\n{0}"
					},
					"Translation":
					{
						"Text": "The following directory could not be created.\n{0}"
					},
					"Key": "MissingStageDirectory"
				},
				{
					"Source":
					{
						"Text": "The installation directory could not be created.\n{0}"
					},
					"Translation":
					{
						"Text": "The installation directory could not be created.\n{0}"
					},
					"Key": "MissingInstallDirectory"
				},
				{
					"Source":
					{
						"Text": "The installation is corrupt. Please contact support."
					},
					"Translation":
					{
						"Text": "The installation is corrupt. Please contact support."
					},
					"Key": "BuildPatchInstallShortError_BuildCorrupt"
				},
				{
					"Source":
					{
						"Text": "The installer failed to initialize. Please contact support."
					},
					"Translation":
					{
						"Text": "The installer failed to initialize. Please contact support."
					},
					"Key": "BuildPatchInstallShortError_InitializationError"
				},
				{
					"Source":
					{
						"Text": "The necessary prerequisites have failed to install. Please contact support."
					},
					"Translation":
					{
						"Text": "The necessary prerequisites have failed to install. Please contact support."
					},
					"Key": "BuildPatchInstallShortError_PrerequisiteError"
				},
				{
					"Source":
					{
						"Text": "The operation was successful."
					},
					"Translation":
					{
						"Text": "The operation was successful."
					},
					"Key": "BuildPatchInstallShortError_NoError"
				},
				{
					"Source":
					{
						"Text": "There is not enough space at {Location}\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Translation":
					{
						"Text": "There is not enough space at {Location}\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Key": "InstallDirectoryDiskSpace"
				},
				{
					"Source":
					{
						"Text": "There is not enough space on your device.\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Translation":
					{
						"Text": "There is not enough space on your device.\n{RequiredBytes} is required.\n{AvailableBytes} is available.\nYou need an additional {SpaceAdditional} to perform the installation."
					},
					"Key": "InstallDirectoryDiskSpaceDevice"
				},
				{
					"Source":
					{
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Translation":
					{
						"Text": "This installation could not continue due to a configuration issue. Please contact support."
					},
					"Key": "InvalidInstallTags"
				},
				{
					"Source":
					{
						"Text": "This installation could not continue due to a prerequisite configuration issue. Please contact support."
					},
					"Translation":
					{
						"Text": "This installation could not continue due to a prerequisite configuration issue. Please contact support."
					},
					"Key": "MissingPrereqForPrereqOnlyInstall"
				},
				{
					"Source":
					{
						"Text": "User cancelled."
					},
					"Translation":
					{
						"Text": "User cancelled."
					},
					"Key": "BuildPatchInstallShortError_UserCanceled"
				}
			]
		},
		{
			"Namespace": "BuildPatchInstallProgress",
			"Children": [
				{
					"Source":
					{
						"Text": "Cleaning up"
					},
					"Translation":
					{
						"Text": "Cleaning up"
					},
					"Key": "EBuildPatchProgress_CleanUp"
				},
				{
					"Source":
					{
						"Text": "Complete"
					},
					"Translation":
					{
						"Text": "Complete"
					},
					"Key": "EBuildPatchProgress_Complete"
				},
				{
					"Source":
					{
						"Text": "Downloading"
					},
					"Translation":
					{
						"Text": "Downloading"
					},
					"Key": "EBuildPatchProgress_Downloading"
				},
				{
					"Source":
					{
						"Text": "Initializing"
					},
					"Translation":
					{
						"Text": "Initializing"
					},
					"Key": "EBuildPatchProgress_Initialising"
				},
				{
					"Source":
					{
						"Text": "Installing"
					},
					"Translation":
					{
						"Text": "Installing"
					},
					"Key": "EBuildPatchProgress_Installing"
				},
				{
					"Source":
					{
						"Text": "Paused"
					},
					"Translation":
					{
						"Text": "Paused"
					},
					"Key": "EBuildPatchProgress_Paused"
				},
				{
					"Source":
					{
						"Text": "Prerequisites"
					},
					"Translation":
					{
						"Text": "Prerequisites"
					},
					"Key": "EBuildPatchProgress_PrerequisitesInstall"
				},
				{
					"Source":
					{
						"Text": "Queued"
					},
					"Translation":
					{
						"Text": "Queued"
					},
					"Key": "EBuildPatchProgress_Queued"
				},
				{
					"Source":
					{
						"Text": "Resuming"
					},
					"Translation":
					{
						"Text": "Resuming"
					},
					"Key": "EBuildPatchProgress_Resuming"
				},
				{
					"Source":
					{
						"Text": "Verifying"
					},
					"Translation":
					{
						"Text": "Verifying"
					},
					"Key": "EBuildPatchProgress_BuildVerification"
				}
			]
		},
		{
			"Namespace": "DynamicRHI",
			"Children": [
				{
					"Source":
					{
						"Text": "NullDrv failure?"
					},
					"Translation":
					{
						"Text": "NullDrv failure?"
					},
					"Key": "NullDrvFailure"
				}
			]
		},
		{
			"Namespace": "GenericPlatform",
			"Children": [
				{
					"Source":
					{
						"Text": "File Manager"
					},
					"Translation":
					{
						"Text": "File Manager"
					},
					"Key": "FileManagerName"
				}
			]
		},
		{
			"Namespace": "GpuProfiler",
			"Children": [
				{
					"Source":
					{
						"Text": "WARNING: This GPU profile was captured with v-sync enabled.  V-sync wait time may show up in any bucket, and as a result the data in this profile may be skewed. Please profile with v-sync disabled to obtain the most accurate data."
					},
					"Translation":
					{
						"Text": "WARNING: This GPU profile was captured with v-sync enabled.  V-sync wait time may show up in any bucket, and as a result the data in this profile may be skewed. Please profile with v-sync disabled to obtain the most accurate data."
					},
					"Key": "GpuProfileVsyncEnabledWarning"
				}
			]
		},
		{
			"Namespace": "InputKeys",
			"Children": [
				{
					"Source":
					{
						"Text": "Acceleration"
					},
					"Translation":
					{
						"Text": "Acceleration"
					},
					"Key": "Acceleration"
				},
				{
					"Source":
					{
						"Text": "Ampersand"
					},
					"Translation":
					{
						"Text": "Ampersand"
					},
					"Key": "Ampersand"
				},
				{
					"Source":
					{
						"Text": "Android"
					},
					"Translation":
					{
						"Text": "Android"
					},
					"Key": "AndroidSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Android Back"
					},
					"Translation":
					{
						"Text": "Android Back"
					},
					"Key": "Android_Back"
				},
				{
					"Source":
					{
						"Text": "Android Menu"
					},
					"Translation":
					{
						"Text": "Android Menu"
					},
					"Key": "Android_Menu"
				},
				{
					"Source":
					{
						"Text": "Android Volume Down"
					},
					"Translation":
					{
						"Text": "Android Volume Down"
					},
					"Key": "Android_Volume_Down"
				},
				{
					"Source":
					{
						"Text": "Android Volume Up"
					},
					"Translation":
					{
						"Text": "Android Volume Up"
					},
					"Key": "Android_Volume_Up"
				},
				{
					"Source":
					{
						"Text": "Any Key"
					},
					"Translation":
					{
						"Text": "Any Key"
					},
					"Key": "AnyKey"
				},
				{
					"Source":
					{
						"Text": "Apostrophe"
					},
					"Translation":
					{
						"Text": "Apostrophe"
					},
					"Key": "Apostrophe"
				},
				{
					"Source":
					{
						"Text": "Asterisk"
					},
					"Translation":
					{
						"Text": "Asterisk"
					},
					"Key": "Asterix"
				},
				{
					"Source":
					{
						"Text": "Backslash"
					},
					"Translation":
					{
						"Text": "Backslash"
					},
					"Key": "Backslash"
				},
				{
					"Source":
					{
						"Text": "Backspace"
					},
					"Translation":
					{
						"Text": "Backspace"
					},
					"Key": "BackSpace"
				},
				{
					"Source":
					{
						"Text": "Caps"
					},
					"Translation":
					{
						"Text": "Caps"
					},
					"Key": "CapsLockShort"
				},
				{
					"Source":
					{
						"Text": "Caps Lock"
					},
					"Translation":
					{
						"Text": "Caps Lock"
					},
					"Key": "CapsLock"
				},
				{
					"Source":
					{
						"Text": "Caret"
					},
					"Translation":
					{
						"Text": "Caret"
					},
					"Key": "Caret"
				},
				{
					"Source":
					{
						"Text": "Colon"
					},
					"Translation":
					{
						"Text": "Colon"
					},
					"Key": "Colon"
				},
				{
					"Source":
					{
						"Text": "Comma"
					},
					"Translation":
					{
						"Text": "Comma"
					},
					"Key": "Comma"
				},
				{
					"Source":
					{
						"Text": "Del"
					},
					"Translation":
					{
						"Text": "Del"
					},
					"Key": "DeleteShort"
				},
				{
					"Source":
					{
						"Text": "Delete"
					},
					"Translation":
					{
						"Text": "Delete"
					},
					"Key": "Delete"
				},
				{
					"Source":
					{
						"Text": "Dollar"
					},
					"Translation":
					{
						"Text": "Dollar"
					},
					"Key": "Dollar"
				},
				{
					"Source":
					{
						"Text": "Down"
					},
					"Translation":
					{
						"Text": "Down"
					},
					"Key": "Down"
				},
				{
					"Source":
					{
						"Text": "End"
					},
					"Translation":
					{
						"Text": "End"
					},
					"Key": "End"
				},
				{
					"Source":
					{
						"Text": "Enter"
					},
					"Translation":
					{
						"Text": "Enter"
					},
					"Key": "Enter"
				},
				{
					"Source":
					{
						"Text": "Equals"
					},
					"Translation":
					{
						"Text": "Equals"
					},
					"Key": "Equals"
				},
				{
					"Source":
					{
						"Text": "Esc"
					},
					"Translation":
					{
						"Text": "Esc"
					},
					"Key": "EscapeShort"
				},
				{
					"Source":
					{
						"Text": "Escape"
					},
					"Translation":
					{
						"Text": "Escape"
					},
					"Key": "Escape"
				},
				{
					"Source":
					{
						"Text": "Exclamation"
					},
					"Translation":
					{
						"Text": "Exclamation"
					},
					"Key": "Exclamation"
				},
				{
					"Source":
					{
						"Text": "F1"
					},
					"Translation":
					{
						"Text": "F1"
					},
					"Key": "F1"
				},
				{
					"Source":
					{
						"Text": "F10"
					},
					"Translation":
					{
						"Text": "F10"
					},
					"Key": "F10"
				},
				{
					"Source":
					{
						"Text": "F11"
					},
					"Translation":
					{
						"Text": "F11"
					},
					"Key": "F11"
				},
				{
					"Source":
					{
						"Text": "F12"
					},
					"Translation":
					{
						"Text": "F12"
					},
					"Key": "F12"
				},
				{
					"Source":
					{
						"Text": "F2"
					},
					"Translation":
					{
						"Text": "F2"
					},
					"Key": "F2"
				},
				{
					"Source":
					{
						"Text": "F3"
					},
					"Translation":
					{
						"Text": "F3"
					},
					"Key": "F3"
				},
				{
					"Source":
					{
						"Text": "F4"
					},
					"Translation":
					{
						"Text": "F4"
					},
					"Key": "F4"
				},
				{
					"Source":
					{
						"Text": "F5"
					},
					"Translation":
					{
						"Text": "F5"
					},
					"Key": "F5"
				},
				{
					"Source":
					{
						"Text": "F6"
					},
					"Translation":
					{
						"Text": "F6"
					},
					"Key": "F6"
				},
				{
					"Source":
					{
						"Text": "F7"
					},
					"Translation":
					{
						"Text": "F7"
					},
					"Key": "F7"
				},
				{
					"Source":
					{
						"Text": "F8"
					},
					"Translation":
					{
						"Text": "F8"
					},
					"Key": "F8"
				},
				{
					"Source":
					{
						"Text": "F9"
					},
					"Translation":
					{
						"Text": "F9"
					},
					"Key": "F9"
				},
				{
					"Source":
					{
						"Text": "Flick"
					},
					"Translation":
					{
						"Text": "Flick"
					},
					"Key": "Gesture_Flick"
				},
				{
					"Source":
					{
						"Text": "Fn+Delete"
					},
					"Translation":
					{
						"Text": "Fn+Delete"
					},
					"Key": "ForwardDelete"
				},
				{
					"Source":
					{
						"Text": "Gamepad"
					},
					"Translation":
					{
						"Text": "Gamepad"
					},
					"Key": "GamepadSubCategory"
				},
				{
					"Source":
					{
						"Text": "Gamepad A"
					},
					"Translation":
					{
						"Text": "Gamepad A"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Bottom"
				},
				{
					"Source":
					{
						"Text": "Gamepad B"
					},
					"Translation":
					{
						"Text": "Gamepad B"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Back"
					},
					"Translation":
					{
						"Text": "Gamepad Back"
					},
					"Key": "XBoxOne_Gamepad_Special_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Circle"
					},
					"Translation":
					{
						"Text": "Gamepad Circle"
					},
					"Key": "PS4_Gamepad_FaceButton_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad D-pad Down"
					},
					"Translation":
					{
						"Text": "Gamepad D-pad Down"
					},
					"Key": "Gamepad_DPad_Down"
				},
				{
					"Source":
					{
						"Text": "Gamepad D-pad Left"
					},
					"Translation":
					{
						"Text": "Gamepad D-pad Left"
					},
					"Key": "Gamepad_DPad_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad D-pad Right"
					},
					"Translation":
					{
						"Text": "Gamepad D-pad Right"
					},
					"Key": "Gamepad_DPad_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad D-pad Up"
					},
					"Translation":
					{
						"Text": "Gamepad D-pad Up"
					},
					"Key": "Gamepad_DPad_Up"
				},
				{
					"Source":
					{
						"Text": "Gamepad Face Button Bottom"
					},
					"Translation":
					{
						"Text": "Gamepad Face Button Bottom"
					},
					"Key": "Gamepad_FaceButton_Bottom"
				},
				{
					"Source":
					{
						"Text": "Gamepad Face Button Left"
					},
					"Translation":
					{
						"Text": "Gamepad Face Button Left"
					},
					"Key": "Gamepad_FaceButton_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Face Button Right"
					},
					"Translation":
					{
						"Text": "Gamepad Face Button Right"
					},
					"Key": "Gamepad_FaceButton_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Face Button Top"
					},
					"Translation":
					{
						"Text": "Gamepad Face Button Top"
					},
					"Key": "Gamepad_FaceButton_Top"
				},
				{
					"Source":
					{
						"Text": "Gamepad L1"
					},
					"Translation":
					{
						"Text": "Gamepad L1"
					},
					"Key": "PS4_Gamepad_LeftShoulder"
				},
				{
					"Source":
					{
						"Text": "Gamepad L2"
					},
					"Translation":
					{
						"Text": "Gamepad L2"
					},
					"Key": "PS4_Gamepad_LeftTrigger"
				},
				{
					"Source":
					{
						"Text": "Gamepad L2 Axis"
					},
					"Translation":
					{
						"Text": "Gamepad L2 Axis"
					},
					"Key": "PS4_Gamepad_LeftTriggerAxis"
				},
				{
					"Source":
					{
						"Text": "Gamepad L3"
					},
					"Translation":
					{
						"Text": "Gamepad L3"
					},
					"Key": "PS4_Gamepad_LeftThumbstick"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Shoulder"
					},
					"Translation":
					{
						"Text": "Gamepad Left Shoulder"
					},
					"Key": "Gamepad_LeftShoulder"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Gamepad Left Thumbstick 2D-Axis"
					},
					"Key": "Gamepad_Left2D"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Gamepad Left Thumbstick Button"
					},
					"Key": "Gamepad_LeftThumbstick"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Gamepad Left Thumbstick Down"
					},
					"Key": "Gamepad_LeftStick_Down"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Gamepad Left Thumbstick Left"
					},
					"Key": "Gamepad_LeftStick_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Gamepad Left Thumbstick Right"
					},
					"Key": "Gamepad_LeftStick_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Gamepad Left Thumbstick Up"
					},
					"Key": "Gamepad_LeftStick_Up"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Gamepad Left Thumbstick X-Axis"
					},
					"Key": "Gamepad_LeftX"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Gamepad Left Thumbstick Y-Axis"
					},
					"Key": "Gamepad_LeftY"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Trigger"
					},
					"Translation":
					{
						"Text": "Gamepad Left Trigger"
					},
					"Key": "Gamepad_LeftTrigger"
				},
				{
					"Source":
					{
						"Text": "Gamepad Left Trigger Axis"
					},
					"Translation":
					{
						"Text": "Gamepad Left Trigger Axis"
					},
					"Key": "Gamepad_LeftTriggerAxis"
				},
				{
					"Source":
					{
						"Text": "Gamepad Options"
					},
					"Translation":
					{
						"Text": "Gamepad Options"
					},
					"Key": "PS4_Gamepad_Special_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad R1"
					},
					"Translation":
					{
						"Text": "Gamepad R1"
					},
					"Key": "PS4_Gamepad_RightShoulder"
				},
				{
					"Source":
					{
						"Text": "Gamepad R2"
					},
					"Translation":
					{
						"Text": "Gamepad R2"
					},
					"Key": "PS4_Gamepad_RightTrigger"
				},
				{
					"Source":
					{
						"Text": "Gamepad R2 Axis"
					},
					"Translation":
					{
						"Text": "Gamepad R2 Axis"
					},
					"Key": "PS4_Gamepad_RightTriggerAxis"
				},
				{
					"Source":
					{
						"Text": "Gamepad R3"
					},
					"Translation":
					{
						"Text": "Gamepad R3"
					},
					"Key": "PS4_Gamepad_RightThumbstick"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Shoulder"
					},
					"Translation":
					{
						"Text": "Gamepad Right Shoulder"
					},
					"Key": "Gamepad_RightShoulder"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Gamepad Right Thumbstick 2D-Axis"
					},
					"Key": "Gamepad_Right2D"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Gamepad Right Thumbstick Button"
					},
					"Key": "Gamepad_RightThumbstick"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Gamepad Right Thumbstick Down"
					},
					"Key": "Gamepad_RightStick_Down"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Gamepad Right Thumbstick Left"
					},
					"Key": "Gamepad_RightStick_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Gamepad Right Thumbstick Right"
					},
					"Key": "Gamepad_RightStick_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Gamepad Right Thumbstick Up"
					},
					"Key": "Gamepad_RightStick_Up"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Gamepad Right Thumbstick X-Axis"
					},
					"Key": "Gamepad_RightX"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Gamepad Right Thumbstick Y-Axis"
					},
					"Key": "Gamepad_RightY"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Trigger"
					},
					"Translation":
					{
						"Text": "Gamepad Right Trigger"
					},
					"Key": "Gamepad_RightTrigger"
				},
				{
					"Source":
					{
						"Text": "Gamepad Right Trigger Axis"
					},
					"Translation":
					{
						"Text": "Gamepad Right Trigger Axis"
					},
					"Key": "Gamepad_RightTriggerAxis"
				},
				{
					"Source":
					{
						"Text": "Gamepad Special Left"
					},
					"Translation":
					{
						"Text": "Gamepad Special Left"
					},
					"Key": "Gamepad_Special_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Special Right"
					},
					"Translation":
					{
						"Text": "Gamepad Special Right"
					},
					"Key": "Gamepad_Special_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Square"
					},
					"Translation":
					{
						"Text": "Gamepad Square"
					},
					"Key": "PS4_Gamepad_FaceButton_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Start"
					},
					"Translation":
					{
						"Text": "Gamepad Start"
					},
					"Key": "XBoxOne_Gamepad_Special_Right"
				},
				{
					"Source":
					{
						"Text": "Gamepad Touchpad Button"
					},
					"Translation":
					{
						"Text": "Gamepad Touchpad Button"
					},
					"Key": "PS4_Gamepad_Special_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad Triangle"
					},
					"Translation":
					{
						"Text": "Gamepad Triangle"
					},
					"Key": "PS4_Gamepad_FaceButton_Top"
				},
				{
					"Source":
					{
						"Text": "Gamepad X"
					},
					"Translation":
					{
						"Text": "Gamepad X"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Left"
				},
				{
					"Source":
					{
						"Text": "Gamepad X"
					},
					"Translation":
					{
						"Text": "Gamepad X"
					},
					"Key": "PS4_Gamepad_FaceButton_Bottom"
				},
				{
					"Source":
					{
						"Text": "Gamepad Y"
					},
					"Translation":
					{
						"Text": "Gamepad Y"
					},
					"Key": "XBoxOne_Gamepad_FaceButton_Top"
				},
				{
					"Source":
					{
						"Text": "Gesture"
					},
					"Translation":
					{
						"Text": "Gesture"
					},
					"Key": "GestureSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Global Back"
					},
					"Translation":
					{
						"Text": "Global Back"
					},
					"Key": "Global_Back"
				},
				{
					"Source":
					{
						"Text": "Global Menu"
					},
					"Translation":
					{
						"Text": "Global Menu"
					},
					"Key": "Global_Menu"
				},
				{
					"Source":
					{
						"Text": "Global Pause"
					},
					"Translation":
					{
						"Text": "Global Pause"
					},
					"Key": "Global_Pause"
				},
				{
					"Source":
					{
						"Text": "Global Play"
					},
					"Translation":
					{
						"Text": "Global Play"
					},
					"Key": "Global_Play"
				},
				{
					"Source":
					{
						"Text": "Global View"
					},
					"Translation":
					{
						"Text": "Global View"
					},
					"Key": "Global_View"
				},
				{
					"Source":
					{
						"Text": "Gravity"
					},
					"Translation":
					{
						"Text": "Gravity"
					},
					"Key": "Gravity"
				},
				{
					"Source":
					{
						"Text": "HTC Vive"
					},
					"Translation":
					{
						"Text": "HTC Vive"
					},
					"Key": "ViveSubCategory"
				},
				{
					"Source":
					{
						"Text": "Home"
					},
					"Translation":
					{
						"Text": "Home"
					},
					"Key": "Home"
				},
				{
					"Source":
					{
						"Text": "Hyphen"
					},
					"Translation":
					{
						"Text": "Hyphen"
					},
					"Key": "Hyphen"
				},
				{
					"Source":
					{
						"Text": "Ins"
					},
					"Translation":
					{
						"Text": "Ins"
					},
					"Key": "InsertShort"
				},
				{
					"Source":
					{
						"Text": "Insert"
					},
					"Translation":
					{
						"Text": "Insert"
					},
					"Key": "Insert"
				},
				{
					"Source":
					{
						"Text": "Keyboard"
					},
					"Translation":
					{
						"Text": "Keyboard"
					},
					"Key": "KeyboardSubCategory"
				},
				{
					"Source":
					{
						"Text": "LMB"
					},
					"Translation":
					{
						"Text": "LMB"
					},
					"Key": "LeftMouseButtonShort"
				},
				{
					"Source":
					{
						"Text": "Left"
					},
					"Translation":
					{
						"Text": "Left"
					},
					"Key": "Left"
				},
				{
					"Source":
					{
						"Text": "Left Alt"
					},
					"Translation":
					{
						"Text": "Left Alt"
					},
					"Key": "LeftAlt"
				},
				{
					"Source":
					{
						"Text": "Left Bracket"
					},
					"Translation":
					{
						"Text": "Left Bracket"
					},
					"Key": "LeftBracket"
				},
				{
					"Source":
					{
						"Text": "Left Cmd"
					},
					"Translation":
					{
						"Text": "Left Cmd"
					},
					"Key": "LeftCommand"
				},
				{
					"Source":
					{
						"Text": "Left Ctrl"
					},
					"Translation":
					{
						"Text": "Left Ctrl"
					},
					"Key": "LeftControl"
				},
				{
					"Source":
					{
						"Text": "Left Mouse Button"
					},
					"Translation":
					{
						"Text": "Left Mouse Button"
					},
					"Key": "LeftMouseButton"
				},
				{
					"Source":
					{
						"Text": "Left Parantheses"
					},
					"Translation":
					{
						"Text": "Left Parantheses"
					},
					"Key": "LeftParantheses"
				},
				{
					"Source":
					{
						"Text": "Left Shift"
					},
					"Translation":
					{
						"Text": "Left Shift"
					},
					"Key": "LeftShift"
				},
				{
					"Source":
					{
						"Text": "Middle Mouse Button"
					},
					"Translation":
					{
						"Text": "Middle Mouse Button"
					},
					"Key": "MiddleMouseButton"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Grip"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Grip"
					},
					"Key": "MixedReality_Left_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Menu"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Menu"
					},
					"Key": "MixedReality_Left_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Thumbstick 2D-Axis"
					},
					"Key": "MixedReality_Left_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Thumbstick Button"
					},
					"Key": "MixedReality_Left_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Thumbstick Down"
					},
					"Key": "MixedReality_Left_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Thumbstick Left"
					},
					"Key": "MixedReality_Left_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Thumbstick Right"
					},
					"Key": "MixedReality_Left_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Thumbstick Up"
					},
					"Key": "MixedReality_Left_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Thumbstick X-Axis"
					},
					"Key": "MixedReality_Left_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Thumbstick Y-Axis"
					},
					"Key": "MixedReality_Left_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trackpad 2D-Axis"
					},
					"Key": "MixedReality_Left_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Button"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trackpad Button"
					},
					"Key": "MixedReality_Left_Trackpad_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trackpad Down"
					},
					"Key": "MixedReality_Left_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trackpad Left"
					},
					"Key": "MixedReality_Left_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trackpad Right"
					},
					"Key": "MixedReality_Left_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trackpad Touch"
					},
					"Key": "MixedReality_Left_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trackpad Up"
					},
					"Key": "MixedReality_Left_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad X"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trackpad X"
					},
					"Key": "MixedReality_Left_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trackpad Y"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trackpad Y"
					},
					"Key": "MixedReality_Left_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trigger"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trigger"
					},
					"Key": "MixedReality_Left_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (L) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (L) Trigger Axis"
					},
					"Key": "MixedReality_Left_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Grip"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Grip"
					},
					"Key": "MixedReality_Right_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Menu"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Menu"
					},
					"Key": "MixedReality_Right_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Thumbstick 2D-Axis"
					},
					"Key": "MixedReality_Right_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Thumbstick Button"
					},
					"Key": "MixedReality_Right_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Thumbstick Down"
					},
					"Key": "MixedReality_Right_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Thumbstick Left"
					},
					"Key": "MixedReality_Right_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Thumbstick Right"
					},
					"Key": "MixedReality_Right_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Thumbstick Up"
					},
					"Key": "MixedReality_Right_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Thumbstick X-Axis"
					},
					"Key": "MixedReality_Right_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Thumbstick Y-Axis"
					},
					"Key": "MixedReality_Right_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trackpad 2D-Axis"
					},
					"Key": "MixedReality_Right_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Button"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trackpad Button"
					},
					"Key": "MixedReality_Right_Trackpad_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trackpad Down"
					},
					"Key": "MixedReality_Right_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trackpad Left"
					},
					"Key": "MixedReality_Right_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trackpad Right"
					},
					"Key": "MixedReality_Right_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trackpad Touch"
					},
					"Key": "MixedReality_Right_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trackpad Up"
					},
					"Key": "MixedReality_Right_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad X"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trackpad X"
					},
					"Key": "MixedReality_Right_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trackpad Y"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trackpad Y"
					},
					"Key": "MixedReality_Right_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trigger"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trigger"
					},
					"Key": "MixedReality_Right_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Mixed Reality (R) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Mixed Reality (R) Trigger Axis"
					},
					"Key": "MixedReality_Right_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Motion"
					},
					"Translation":
					{
						"Text": "Motion"
					},
					"Key": "MotionSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Mouse"
					},
					"Translation":
					{
						"Text": "Mouse"
					},
					"Key": "MouseSubCategory"
				},
				{
					"Source":
					{
						"Text": "Mouse Wheel Axis"
					},
					"Translation":
					{
						"Text": "Mouse Wheel Axis"
					},
					"Key": "MouseWheelAxis"
				},
				{
					"Source":
					{
						"Text": "Mouse Wheel Down"
					},
					"Translation":
					{
						"Text": "Mouse Wheel Down"
					},
					"Key": "MouseScrollDown"
				},
				{
					"Source":
					{
						"Text": "Mouse Wheel Up"
					},
					"Translation":
					{
						"Text": "Mouse Wheel Up"
					},
					"Key": "MouseScrollUp"
				},
				{
					"Source":
					{
						"Text": "Mouse X"
					},
					"Translation":
					{
						"Text": "Mouse X"
					},
					"Key": "MouseX"
				},
				{
					"Source":
					{
						"Text": "Mouse XY 2D-Axis"
					},
					"Translation":
					{
						"Text": "Mouse XY 2D-Axis"
					},
					"Key": "Mouse2D"
				},
				{
					"Source":
					{
						"Text": "Mouse Y"
					},
					"Translation":
					{
						"Text": "Mouse Y"
					},
					"Key": "MouseY"
				},
				{
					"Source":
					{
						"Text": "Num *"
					},
					"Translation":
					{
						"Text": "Num *"
					},
					"Key": "Multiply"
				},
				{
					"Source":
					{
						"Text": "Num +"
					},
					"Translation":
					{
						"Text": "Num +"
					},
					"Key": "Add"
				},
				{
					"Source":
					{
						"Text": "Num -"
					},
					"Translation":
					{
						"Text": "Num -"
					},
					"Key": "Subtract"
				},
				{
					"Source":
					{
						"Text": "Num ."
					},
					"Translation":
					{
						"Text": "Num ."
					},
					"Key": "Decimal"
				},
				{
					"Source":
					{
						"Text": "Num /"
					},
					"Translation":
					{
						"Text": "Num /"
					},
					"Key": "Divide"
				},
				{
					"Source":
					{
						"Text": "Num 0"
					},
					"Translation":
					{
						"Text": "Num 0"
					},
					"Key": "NumPadZero"
				},
				{
					"Source":
					{
						"Text": "Num 1"
					},
					"Translation":
					{
						"Text": "Num 1"
					},
					"Key": "NumPadOne"
				},
				{
					"Source":
					{
						"Text": "Num 2"
					},
					"Translation":
					{
						"Text": "Num 2"
					},
					"Key": "NumPadTwo"
				},
				{
					"Source":
					{
						"Text": "Num 3"
					},
					"Translation":
					{
						"Text": "Num 3"
					},
					"Key": "NumPadThree"
				},
				{
					"Source":
					{
						"Text": "Num 4"
					},
					"Translation":
					{
						"Text": "Num 4"
					},
					"Key": "NumPadFour"
				},
				{
					"Source":
					{
						"Text": "Num 5"
					},
					"Translation":
					{
						"Text": "Num 5"
					},
					"Key": "NumPadFive"
				},
				{
					"Source":
					{
						"Text": "Num 6"
					},
					"Translation":
					{
						"Text": "Num 6"
					},
					"Key": "NumPadSix"
				},
				{
					"Source":
					{
						"Text": "Num 7"
					},
					"Translation":
					{
						"Text": "Num 7"
					},
					"Key": "NumPadSeven"
				},
				{
					"Source":
					{
						"Text": "Num 8"
					},
					"Translation":
					{
						"Text": "Num 8"
					},
					"Key": "NumPadEight"
				},
				{
					"Source":
					{
						"Text": "Num 9"
					},
					"Translation":
					{
						"Text": "Num 9"
					},
					"Key": "NumPadNine"
				},
				{
					"Source":
					{
						"Text": "Num Lock"
					},
					"Translation":
					{
						"Text": "Num Lock"
					},
					"Key": "NumLock"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch"
					},
					"Key": "OculusTouchSubCategory"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Grip"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Grip"
					},
					"Key": "OculusTouch_Left_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Grip Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Grip Axis"
					},
					"Key": "OculusTouch_Left_Grip_Axis"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Menu"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Menu"
					},
					"Key": "OculusTouch_Left_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Thumbstick 2D-Axis"
					},
					"Key": "OculusTouch_Left_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Thumbstick Button"
					},
					"Key": "OculusTouch_Left_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Thumbstick Down"
					},
					"Key": "OculusTouch_Left_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Thumbstick Left"
					},
					"Key": "OculusTouch_Left_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Thumbstick Right"
					},
					"Key": "OculusTouch_Left_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Thumbstick Touch"
					},
					"Key": "OculusTouch_Left_Thumbstick_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Thumbstick Up"
					},
					"Key": "OculusTouch_Left_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Thumbstick X-Axis"
					},
					"Key": "OculusTouch_Left_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Thumbstick Y-Axis"
					},
					"Key": "OculusTouch_Left_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Trigger"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Trigger"
					},
					"Key": "OculusTouch_Left_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Trigger Axis"
					},
					"Key": "OculusTouch_Left_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Trigger Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Trigger Touch"
					},
					"Key": "OculusTouch_Left_Trigger_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) X Press"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) X Press"
					},
					"Key": "OculusTouch_Left_X_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) X Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) X Touch"
					},
					"Key": "OculusTouch_Left_X_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Y Press"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Y Press"
					},
					"Key": "OculusTouch_Left_Y_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (L) Y Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (L) Y Touch"
					},
					"Key": "OculusTouch_Left_Y_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) A Press"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) A Press"
					},
					"Key": "OculusTouch_Right_A_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) A Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) A Touch"
					},
					"Key": "OculusTouch_Right_A_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) B Press"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) B Press"
					},
					"Key": "OculusTouch_Right_B_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) B Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) B Touch"
					},
					"Key": "OculusTouch_Right_B_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Grip"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Grip"
					},
					"Key": "OculusTouch_Right_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Grip Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Grip Axis"
					},
					"Key": "OculusTouch_Right_Grip_Axis"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) System"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) System"
					},
					"Key": "OculusTouch_Right_System_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Thumbstick 2D-Axis"
					},
					"Key": "OculusTouch_Right_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Thumbstick Button"
					},
					"Key": "OculusTouch_Right_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Thumbstick Down"
					},
					"Key": "OculusTouch_Right_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Thumbstick Left"
					},
					"Key": "OculusTouch_Right_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Thumbstick Right"
					},
					"Key": "OculusTouch_Right_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Thumbstick Touch"
					},
					"Key": "OculusTouch_Right_Thumbstick_Touch"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Thumbstick Up"
					},
					"Key": "OculusTouch_Right_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Thumbstick X-Axis"
					},
					"Key": "OculusTouch_Right_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Thumbstick Y-Axis"
					},
					"Key": "OculusTouch_Right_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Trigger"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Trigger"
					},
					"Key": "OculusTouch_Right_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Trigger Axis"
					},
					"Key": "OculusTouch_Right_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Oculus Touch (R) Trigger Touch"
					},
					"Translation":
					{
						"Text": "Oculus Touch (R) Trigger Touch"
					},
					"Key": "OculusTouch_Right_Trigger_Touch"
				},
				{
					"Source":
					{
						"Text": "PS4_Special_DEPRECATED"
					},
					"Translation":
					{
						"Text": "PS4_Special_DEPRECATED"
					},
					"Key": "PS4_Special"
				},
				{
					"Source":
					{
						"Text": "Page Down"
					},
					"Translation":
					{
						"Text": "Page Down"
					},
					"Key": "PageDown"
				},
				{
					"Source":
					{
						"Text": "Page Up"
					},
					"Translation":
					{
						"Text": "Page Up"
					},
					"Key": "PageUp"
				},
				{
					"Source":
					{
						"Text": "Pause"
					},
					"Translation":
					{
						"Text": "Pause"
					},
					"Key": "Pause"
				},
				{
					"Source":
					{
						"Text": "Period"
					},
					"Translation":
					{
						"Text": "Period"
					},
					"Key": "Period"
				},
				{
					"Source":
					{
						"Text": "PgDn"
					},
					"Translation":
					{
						"Text": "PgDn"
					},
					"Key": "PageDownShort"
				},
				{
					"Source":
					{
						"Text": "PgUp"
					},
					"Translation":
					{
						"Text": "PgUp"
					},
					"Key": "PageUpShort"
				},
				{
					"Source":
					{
						"Text": "Pinch"
					},
					"Translation":
					{
						"Text": "Pinch"
					},
					"Key": "Gesture_Pinch"
				},
				{
					"Source":
					{
						"Text": "Quote"
					},
					"Translation":
					{
						"Text": "Quote"
					},
					"Key": "Quote"
				},
				{
					"Source":
					{
						"Text": "RMB"
					},
					"Translation":
					{
						"Text": "RMB"
					},
					"Key": "RightMouseButtonShort"
				},
				{
					"Source":
					{
						"Text": "Right"
					},
					"Translation":
					{
						"Text": "Right"
					},
					"Key": "Right"
				},
				{
					"Source":
					{
						"Text": "Right Alt"
					},
					"Translation":
					{
						"Text": "Right Alt"
					},
					"Key": "RightAlt"
				},
				{
					"Source":
					{
						"Text": "Right Bracket"
					},
					"Translation":
					{
						"Text": "Right Bracket"
					},
					"Key": "RightBracket"
				},
				{
					"Source":
					{
						"Text": "Right Cmd"
					},
					"Translation":
					{
						"Text": "Right Cmd"
					},
					"Key": "RightCommand"
				},
				{
					"Source":
					{
						"Text": "Right Ctrl"
					},
					"Translation":
					{
						"Text": "Right Ctrl"
					},
					"Key": "RightControl"
				},
				{
					"Source":
					{
						"Text": "Right Mouse Button"
					},
					"Translation":
					{
						"Text": "Right Mouse Button"
					},
					"Key": "RightMouseButton"
				},
				{
					"Source":
					{
						"Text": "Right Parantheses"
					},
					"Translation":
					{
						"Text": "Right Parantheses"
					},
					"Key": "RightParantheses"
				},
				{
					"Source":
					{
						"Text": "Right Shift"
					},
					"Translation":
					{
						"Text": "Right Shift"
					},
					"Key": "RightShift"
				},
				{
					"Source":
					{
						"Text": "Rotate"
					},
					"Translation":
					{
						"Text": "Rotate"
					},
					"Key": "Gesture_Rotate"
				},
				{
					"Source":
					{
						"Text": "Rotation Rate"
					},
					"Translation":
					{
						"Text": "Rotation Rate"
					},
					"Key": "RotationRate"
				},
				{
					"Source":
					{
						"Text": "Scroll Lock"
					},
					"Translation":
					{
						"Text": "Scroll Lock"
					},
					"Key": "ScrollLock"
				},
				{
					"Source":
					{
						"Text": "Semicolon"
					},
					"Translation":
					{
						"Text": "Semicolon"
					},
					"Key": "Semicolon"
				},
				{
					"Source":
					{
						"Text": "Slash"
					},
					"Translation":
					{
						"Text": "Slash"
					},
					"Key": "Slash"
				},
				{
					"Source":
					{
						"Text": "Space"
					},
					"Translation":
					{
						"Text": "Space"
					},
					"Key": "SpaceBarShort"
				},
				{
					"Source":
					{
						"Text": "Space Bar"
					},
					"Translation":
					{
						"Text": "Space Bar"
					},
					"Key": "SpaceBar"
				},
				{
					"Source":
					{
						"Text": "SpecialGamepad"
					},
					"Translation":
					{
						"Text": "SpecialGamepad"
					},
					"Key": "SpecialGamepadSubCategory"
				},
				{
					"Source":
					{
						"Text": "Steam"
					},
					"Translation":
					{
						"Text": "Steam"
					},
					"Key": "SteamSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Steam Back Left"
					},
					"Translation":
					{
						"Text": "Steam Back Left"
					},
					"Key": "Steam_Back_Left"
				},
				{
					"Source":
					{
						"Text": "Steam Back Right"
					},
					"Translation":
					{
						"Text": "Steam Back Right"
					},
					"Key": "Steam_Back_Right"
				},
				{
					"Source":
					{
						"Text": "Steam Touch 0"
					},
					"Translation":
					{
						"Text": "Steam Touch 0"
					},
					"Key": "Steam_Touch_0"
				},
				{
					"Source":
					{
						"Text": "Steam Touch 1"
					},
					"Translation":
					{
						"Text": "Steam Touch 1"
					},
					"Key": "Steam_Touch_1"
				},
				{
					"Source":
					{
						"Text": "Steam Touch 2"
					},
					"Translation":
					{
						"Text": "Steam Touch 2"
					},
					"Key": "Steam_Touch_2"
				},
				{
					"Source":
					{
						"Text": "Steam Touch 3"
					},
					"Translation":
					{
						"Text": "Steam Touch 3"
					},
					"Key": "Steam_Touch_3"
				},
				{
					"Source":
					{
						"Text": "Tab"
					},
					"Translation":
					{
						"Text": "Tab"
					},
					"Key": "Tab"
				},
				{
					"Source":
					{
						"Text": "Thumb Mouse Button"
					},
					"Translation":
					{
						"Text": "Thumb Mouse Button"
					},
					"Key": "ThumbMouseButton"
				},
				{
					"Source":
					{
						"Text": "Thumb Mouse Button 2"
					},
					"Translation":
					{
						"Text": "Thumb Mouse Button 2"
					},
					"Key": "ThumbMouseButton2"
				},
				{
					"Source":
					{
						"Text": "Tilt"
					},
					"Translation":
					{
						"Text": "Tilt"
					},
					"Key": "Tilt"
				},
				{
					"Source":
					{
						"Text": "Touch"
					},
					"Translation":
					{
						"Text": "Touch"
					},
					"Key": "TouchSubCateogry"
				},
				{
					"Source":
					{
						"Text": "Touch {0}"
					},
					"Translation":
					{
						"Text": "Touch {0}"
					},
					"Key": "TouchFormat"
				},
				{
					"Source":
					{
						"Text": "Touchpad Button X Axis"
					},
					"Translation":
					{
						"Text": "Touchpad Button X Axis"
					},
					"Key": "Gamepad_Special_Left_X"
				},
				{
					"Source":
					{
						"Text": "Touchpad Button Y Axis"
					},
					"Translation":
					{
						"Text": "Touchpad Button Y Axis"
					},
					"Key": "Gamepad_Special_Left_Y"
				},
				{
					"Source":
					{
						"Text": "Underscore"
					},
					"Translation":
					{
						"Text": "Underscore"
					},
					"Key": "Underscore"
				},
				{
					"Source":
					{
						"Text": "Up"
					},
					"Translation":
					{
						"Text": "Up"
					},
					"Key": "Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index"
					},
					"Translation":
					{
						"Text": "Valve Index"
					},
					"Key": "ValveIndexSubCategory"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) A Press"
					},
					"Translation":
					{
						"Text": "Valve Index (L) A Press"
					},
					"Key": "ValveIndex_Left_A_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) A Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (L) A Touch"
					},
					"Key": "ValveIndex_Left_A_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) B Press"
					},
					"Translation":
					{
						"Text": "Valve Index (L) B Press"
					},
					"Key": "ValveIndex_Left_B_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) B Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (L) B Touch"
					},
					"Key": "ValveIndex_Left_B_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Grip Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Grip Axis"
					},
					"Key": "ValveIndex_Left_Grip_Axis"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Grip Force"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Grip Force"
					},
					"Key": "ValveIndex_Left_Grip_Force"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) System"
					},
					"Translation":
					{
						"Text": "Valve Index (L) System"
					},
					"Key": "ValveIndex_Left_System_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) System Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (L) System Touch"
					},
					"Key": "ValveIndex_Left_System_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Thumbstick 2D-Axis"
					},
					"Key": "ValveIndex_Left_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Thumbstick Button"
					},
					"Key": "ValveIndex_Left_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Thumbstick Down"
					},
					"Key": "ValveIndex_Left_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Thumbstick Left"
					},
					"Key": "ValveIndex_Left_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Thumbstick Right"
					},
					"Key": "ValveIndex_Left_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Thumbstick Touch"
					},
					"Key": "ValveIndex_Left_Thumbstick_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Thumbstick Up"
					},
					"Key": "ValveIndex_Left_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Thumbstick X-Axis"
					},
					"Key": "ValveIndex_Left_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Thumbstick Y-Axis"
					},
					"Key": "ValveIndex_Left_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trackpad 2D-Axis"
					},
					"Key": "ValveIndex_Left_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trackpad Down"
					},
					"Key": "ValveIndex_Left_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Force"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trackpad Force"
					},
					"Key": "ValveIndex_Left_Trackpad_Force"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trackpad Left"
					},
					"Key": "ValveIndex_Left_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trackpad Right"
					},
					"Key": "ValveIndex_Left_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trackpad Touch"
					},
					"Key": "ValveIndex_Left_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trackpad Up"
					},
					"Key": "ValveIndex_Left_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad X"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trackpad X"
					},
					"Key": "ValveIndex_Left_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trackpad Y"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trackpad Y"
					},
					"Key": "ValveIndex_Left_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trigger"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trigger"
					},
					"Key": "ValveIndex_Left_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trigger Axis"
					},
					"Key": "ValveIndex_Left_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Valve Index (L) Trigger Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (L) Trigger Touch"
					},
					"Key": "ValveIndex_Left_Trigger_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) A Press"
					},
					"Translation":
					{
						"Text": "Valve Index (R) A Press"
					},
					"Key": "ValveIndex_Right_A_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) A Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (R) A Touch"
					},
					"Key": "ValveIndex_Right_A_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) B Press"
					},
					"Translation":
					{
						"Text": "Valve Index (R) B Press"
					},
					"Key": "ValveIndex_Right_B_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) B Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (R) B Touch"
					},
					"Key": "ValveIndex_Right_B_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Grip Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Grip Axis"
					},
					"Key": "ValveIndex_Right_Grip_Axis"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Grip Force"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Grip Force"
					},
					"Key": "ValveIndex_Right_Grip_Force"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) System"
					},
					"Translation":
					{
						"Text": "Valve Index (R) System"
					},
					"Key": "ValveIndex_Right_System_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) System Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (R) System Touch"
					},
					"Key": "ValveIndex_Right_System_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick 2D-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Thumbstick 2D-Axis"
					},
					"Key": "ValveIndex_Right_Thumbstick_2D"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Button"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Thumbstick Button"
					},
					"Key": "ValveIndex_Right_Thumbstick_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Down"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Thumbstick Down"
					},
					"Key": "ValveIndex_Right_Thumbstick_Down"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Left"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Thumbstick Left"
					},
					"Key": "ValveIndex_Right_Thumbstick_Left"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Right"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Thumbstick Right"
					},
					"Key": "ValveIndex_Right_Thumbstick_Right"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Thumbstick Touch"
					},
					"Key": "ValveIndex_Right_Thumbstick_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Up"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Thumbstick Up"
					},
					"Key": "ValveIndex_Right_Thumbstick_Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick X-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Thumbstick X-Axis"
					},
					"Key": "ValveIndex_Right_Thumbstick_X"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Thumbstick Y-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Thumbstick Y-Axis"
					},
					"Key": "ValveIndex_Right_Thumbstick_Y"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trackpad 2D-Axis"
					},
					"Key": "ValveIndex_Right_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trackpad Down"
					},
					"Key": "ValveIndex_Right_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Force"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trackpad Force"
					},
					"Key": "ValveIndex_Right_Trackpad_Force"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trackpad Left"
					},
					"Key": "ValveIndex_Right_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trackpad Right"
					},
					"Key": "ValveIndex_Right_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trackpad Touch"
					},
					"Key": "ValveIndex_Right_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trackpad Up"
					},
					"Key": "ValveIndex_Right_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad X"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trackpad X"
					},
					"Key": "ValveIndex_Right_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trackpad Y"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trackpad Y"
					},
					"Key": "ValveIndex_Right_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trigger"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trigger"
					},
					"Key": "ValveIndex_Right_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trigger Axis"
					},
					"Key": "ValveIndex_Right_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Valve Index (R) Trigger Touch"
					},
					"Translation":
					{
						"Text": "Valve Index (R) Trigger Touch"
					},
					"Key": "ValveIndex_Right_Trigger_Touch"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Grip"
					},
					"Translation":
					{
						"Text": "Vive (L) Grip"
					},
					"Key": "Vive_Left_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Menu"
					},
					"Translation":
					{
						"Text": "Vive (L) Menu"
					},
					"Key": "Vive_Left_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) System"
					},
					"Translation":
					{
						"Text": "Vive (L) System"
					},
					"Key": "Vive_Left_System_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Vive (L) Trackpad 2D-Axis"
					},
					"Key": "Vive_Left_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Button"
					},
					"Translation":
					{
						"Text": "Vive (L) Trackpad Button"
					},
					"Key": "Vive_Left_Trackpad_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Vive (L) Trackpad Down"
					},
					"Key": "Vive_Left_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Vive (L) Trackpad Left"
					},
					"Key": "Vive_Left_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Vive (L) Trackpad Right"
					},
					"Key": "Vive_Left_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Vive (L) Trackpad Touch"
					},
					"Key": "Vive_Left_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Vive (L) Trackpad Up"
					},
					"Key": "Vive_Left_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad X-Axis"
					},
					"Translation":
					{
						"Text": "Vive (L) Trackpad X-Axis"
					},
					"Key": "Vive_Left_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trackpad Y-Axis"
					},
					"Translation":
					{
						"Text": "Vive (L) Trackpad Y-Axis"
					},
					"Key": "Vive_Left_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trigger"
					},
					"Translation":
					{
						"Text": "Vive (L) Trigger"
					},
					"Key": "Vive_Left_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (L) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Vive (L) Trigger Axis"
					},
					"Key": "Vive_Left_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Grip"
					},
					"Translation":
					{
						"Text": "Vive (R) Grip"
					},
					"Key": "Vive_Right_Grip_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Menu"
					},
					"Translation":
					{
						"Text": "Vive (R) Menu"
					},
					"Key": "Vive_Right_Menu_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) System"
					},
					"Translation":
					{
						"Text": "Vive (R) System"
					},
					"Key": "Vive_Right_System_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad 2D-Axis"
					},
					"Translation":
					{
						"Text": "Vive (R) Trackpad 2D-Axis"
					},
					"Key": "Vive_Right_Trackpad_2D"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Button"
					},
					"Translation":
					{
						"Text": "Vive (R) Trackpad Button"
					},
					"Key": "Vive_Right_Trackpad_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Down"
					},
					"Translation":
					{
						"Text": "Vive (R) Trackpad Down"
					},
					"Key": "Vive_Right_Trackpad_Down"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Left"
					},
					"Translation":
					{
						"Text": "Vive (R) Trackpad Left"
					},
					"Key": "Vive_Right_Trackpad_Left"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Right"
					},
					"Translation":
					{
						"Text": "Vive (R) Trackpad Right"
					},
					"Key": "Vive_Right_Trackpad_Right"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Touch"
					},
					"Translation":
					{
						"Text": "Vive (R) Trackpad Touch"
					},
					"Key": "Vive_Right_Trackpad_Touch"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Up"
					},
					"Translation":
					{
						"Text": "Vive (R) Trackpad Up"
					},
					"Key": "Vive_Right_Trackpad_Up"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad X-Axis"
					},
					"Translation":
					{
						"Text": "Vive (R) Trackpad X-Axis"
					},
					"Key": "Vive_Right_Trackpad_X"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trackpad Y-Axis"
					},
					"Translation":
					{
						"Text": "Vive (R) Trackpad Y-Axis"
					},
					"Key": "Vive_Right_Trackpad_Y"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trigger"
					},
					"Translation":
					{
						"Text": "Vive (R) Trigger"
					},
					"Key": "Vive_Right_Trigger_Click"
				},
				{
					"Source":
					{
						"Text": "Vive (R) Trigger Axis"
					},
					"Translation":
					{
						"Text": "Vive (R) Trigger Axis"
					},
					"Key": "Vive_Right_Trigger_Axis"
				},
				{
					"Source":
					{
						"Text": "Windows Mixed Reality"
					},
					"Translation":
					{
						"Text": "Windows Mixed Reality"
					},
					"Key": "MixedRealitySubCategory"
				},
				{
					"Source":
					{
						"Text": "XBox One"
					},
					"Translation":
					{
						"Text": "XBox One"
					},
					"Key": "XBoxOneSubCateogry"
				}
			]
		},
		{
			"Namespace": "LinuxDynamicRHI",
			"Children": [
				{
					"Source":
					{
						"Text": "Failed to load OpenGL Driver which is required to run the engine.\nOpenGL4 has been deprecated and should use Vulkan."
					},
					"Translation":
					{
						"Text": "Failed to load OpenGL Driver which is required to run the engine.\nOpenGL4 has been deprecated and should use Vulkan."
					},
					"Key": "NoOpenGLDriver"
				},
				{
					"Source":
					{
						"Text": "Failed to load Vulkan Driver which is required to run the engine.\nThe engine no longer fallbacks to OpenGL4 which has been deprecated."
					},
					"Translation":
					{
						"Text": "Failed to load Vulkan Driver which is required to run the engine.\nThe engine no longer fallbacks to OpenGL4 which has been deprecated."
					},
					"Key": "NoVulkanDriver"
				},
				{
					"Source":
					{
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Translation":
					{
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Key": "RequiredOpenGL"
				},
				{
					"Source":
					{
						"Text": "The project does not target Vulkan or OpenGL RHIs, check project settings or pass -nullrhi."
					},
					"Translation":
					{
						"Text": "The project does not target Vulkan or OpenGL RHIs, check project settings or pass -nullrhi."
					},
					"Key": "NoTargetedRHI"
				},
				{
					"Source":
					{
						"Text": "Trying to force OpenGL RHI but the project does not have it in TargetedRHIs list."
					},
					"Translation":
					{
						"Text": "Trying to force OpenGL RHI but the project does not have it in TargetedRHIs list."
					},
					"Key": "NoOpenGLTargetedRHI"
				},
				{
					"Source":
					{
						"Text": "Trying to force Vulkan RHI but the project does not have it in TargetedRHIs list."
					},
					"Translation":
					{
						"Text": "Trying to force Vulkan RHI but the project does not have it in TargetedRHIs list."
					},
					"Key": "NoVulkanTargetedRHI"
				},
				{
					"Source":
					{
						"Text": "Trying to force specific Vulkan feature level but it is not supported."
					},
					"Translation":
					{
						"Text": "Trying to force specific Vulkan feature level but it is not supported."
					},
					"Key": "UnsupportedVulkanTargetedRHI"
				},
				{
					"Source":
					{
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Translation":
					{
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Key": "RequiredVulkan"
				},
				{
					"Source":
					{
						"Text": "Vulkan or OpenGL (4.3) support is required to run the engine."
					},
					"Translation":
					{
						"Text": "Vulkan or OpenGL (4.3) support is required to run the engine."
					},
					"Key": "NoVulkanNoGL"
				},
				{
					"Source":
					{
						"Text": "Warning: OpenGL is no longer supported for desktop platforms. Vulkan will be used instead."
					},
					"Translation":
					{
						"Text": "Warning: OpenGL is no longer supported for desktop platforms. Vulkan will be used instead."
					},
					"Key": "OpenGLRemoved"
				}
			]
		},
		{
			"Namespace": "MessageDialog",
			"Children": [
				{
					"Source":
					{
						"Text": "Please update to the latest version of macOS for best performance and stability."
					},
					"Translation":
					{
						"Text": "Please update to the latest version of macOS for best performance and stability."
					},
					"Key": "UpdateMacOSX_Body"
				},
				{
					"Source":
					{
						"Text": "The installed version of the {Vendor} graphics driver has known issues in {RHI}.\nPlease install the recommended driver version or switch to a different rendering API.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation":
					{
						"Text": "The installed version of the {Vendor} graphics driver has known issues in {RHI}.\nPlease install the recommended driver version or switch to a different rendering API.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Key": "VideoCardDriverRHIIssueReport"
				},
				{
					"Source":
					{
						"Text": "The installed version of the {Vendor} graphics driver has known issues.\nPlease install the recommended driver version.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Translation":
					{
						"Text": "The installed version of the {Vendor} graphics driver has known issues.\nPlease install the recommended driver version.\n\nWould you like to visit the following URL to download the driver?\n\n{Hyperlink}\n\n{AdapterName}\nInstalled: {InstalledVer}\nRecommended: {RecommendedVer}"
					},
					"Key": "VideoCardDriverIssueReport"
				},
				{
					"Source":
					{
						"Text": "Update macOS"
					},
					"Translation":
					{
						"Text": "Update macOS"
					},
					"Key": "UpdateMacOSX_Title"
				},
				{
					"Source":
					{
						"Text": "WARNING: Known issues with graphics driver"
					},
					"Translation":
					{
						"Text": "WARNING: Known issues with graphics driver"
					},
					"Key": "TitleVideoCardDriverIssue"
				},
				{
					"Source":
					{
						"Text": "https://downloadcenter.intel.com/product/80939/Graphics"
					},
					"Translation":
					{
						"Text": "https://downloadcenter.intel.com/product/80939/Graphics"
					},
					"Key": "DriverDownloadLinkIntel"
				},
				{
					"Source":
					{
						"Text": "https://www.amd.com/en/support"
					},
					"Translation":
					{
						"Text": "https://www.amd.com/en/support"
					},
					"Key": "DriverDownloadLinkAMD"
				},
				{
					"Source":
					{
						"Text": "https://www.nvidia.com/download/index.aspx"
					},
					"Translation":
					{
						"Text": "https://www.nvidia.com/download/index.aspx"
					},
					"Key": "DriverDownloadLinkNVIDIA"
				},
				{
					"Source":
					{
						"Text": "latest driver available"
					},
					"Translation":
					{
						"Text": "latest driver available"
					},
					"Key": "LatestDriver"
				},
				{
					"Source":
					{
						"Text": "{0} or latest driver available"
					},
					"Translation":
					{
						"Text": "{0} or latest driver available"
					},
					"Key": "SuggestedDriverOrLatest"
				}
			]
		},
		{
			"Namespace": "UnrealBuildConfigurations",
			"Children": [
				{
					"Source":
					{
						"Text": "Debug"
					},
					"Translation":
					{
						"Text": "Debug"
					},
					"Key": "DebugName"
				},
				{
					"Source":
					{
						"Text": "DebugGame"
					},
					"Translation":
					{
						"Text": "DebugGame"
					},
					"Key": "DebugGameName"
				},
				{
					"Source":
					{
						"Text": "Development"
					},
					"Translation":
					{
						"Text": "Development"
					},
					"Key": "DevelopmentName"
				},
				{
					"Source":
					{
						"Text": "Shipping"
					},
					"Translation":
					{
						"Text": "Shipping"
					},
					"Key": "ShippingName"
				},
				{
					"Source":
					{
						"Text": "Test"
					},
					"Translation":
					{
						"Text": "Test"
					},
					"Key": "TestName"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "Unknown"
					},
					"Key": "UnknownName"
				}
			]
		},
		{
			"Namespace": "WindowsDynamicRHI",
			"Children": [
				{
					"Source":
					{
						"Text": "-d3d12/dx12, -d3d11/dx11, -vulkan, and -opengl are mutually exclusive options, but more than one was specified on the command-line."
					},
					"Translation":
					{
						"Text": "-d3d12/dx12, -d3d11/dx11, -vulkan, and -opengl are mutually exclusive options, but more than one was specified on the command-line."
					},
					"Key": "RHIOptionsError"
				},
				{
					"Source":
					{
						"Text": "<Unknown>"
					},
					"Translation":
					{
						"Text": "<Unknown>"
					},
					"Key": "UnknownRHI"
				},
				{
					"Source":
					{
						"Text": "<unknown>"
					},
					"Translation":
					{
						"Text": "<unknown>"
					},
					"Key": "FeatureLevelUnknown"
				},
				{
					"Source":
					{
						"Text": "A D3D11-compatible GPU (Feature Level 11.0, Shader Model 5.0) is required to run the engine."
					},
					"Translation":
					{
						"Text": "A D3D11-compatible GPU (Feature Level 11.0, Shader Model 5.0) is required to run the engine."
					},
					"Key": "RequiredDX11Feature_11_SM5"
				},
				{
					"Source":
					{
						"Text": "DirectX 11"
					},
					"Translation":
					{
						"Text": "DirectX 11"
					},
					"Key": "D3D11"
				},
				{
					"Source":
					{
						"Text": "DirectX 12"
					},
					"Translation":
					{
						"Text": "DirectX 12"
					},
					"Key": "D3D12"
				},
				{
					"Source":
					{
						"Text": "DirectX 12 is not supported on your system. Try running without the -dx12 or -d3d12 command line argument."
					},
					"Translation":
					{
						"Text": "DirectX 12 is not supported on your system. Try running without the -dx12 or -d3d12 command line argument."
					},
					"Key": "RequiredDX12"
				},
				{
					"Source":
					{
						"Text": "DirectX 12 with Feature Level SM6 is not supported on your system. Try running without the -sm6 command line argument."
					},
					"Translation":
					{
						"Text": "DirectX 12 with Feature Level SM6 is not supported on your system. Try running without the -sm6 command line argument."
					},
					"Key": "RequiredDX12SM6"
				},
				{
					"Source":
					{
						"Text": "ES3_1"
					},
					"Translation":
					{
						"Text": "ES3_1"
					},
					"Key": "FeatureLevelES31"
				},
				{
					"Source":
					{
						"Text": "OpenGL"
					},
					"Translation":
					{
						"Text": "OpenGL"
					},
					"Key": "OpenGL"
				},
				{
					"Source":
					{
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Translation":
					{
						"Text": "OpenGL 4.3 is required to run the engine."
					},
					"Key": "RequiredOpenGL"
				},
				{
					"Source":
					{
						"Text": "SM5"
					},
					"Translation":
					{
						"Text": "SM5"
					},
					"Key": "FeatureLevelSM4"
				},
				{
					"Source":
					{
						"Text": "SM6"
					},
					"Translation":
					{
						"Text": "SM6"
					},
					"Key": "FeatureLevelSM6"
				},
				{
					"Source":
					{
						"Text": "Unable to launch with RHI '{0}' since the project is not configured to support it."
					},
					"Translation":
					{
						"Text": "Unable to launch with RHI '{0}' since the project is not configured to support it."
					},
					"Key": "MissingTargetedShaderFormats"
				},
				{
					"Source":
					{
						"Text": "Vulkan"
					},
					"Translation":
					{
						"Text": "Vulkan"
					},
					"Key": "Vulkan"
				},
				{
					"Source":
					{
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Translation":
					{
						"Text": "Vulkan Driver is required to run the engine."
					},
					"Key": "RequiredVulkan"
				},
				{
					"Source":
					{
						"Text": "{0} does not support {1}."
					},
					"Translation":
					{
						"Text": "{0} does not support {1}."
					},
					"Key": "RHINotSupported"
				}
			]
		}
	]
}